Revit 2027 API
BuiltInFailures.TrussFailures.RemoveTrussSketch Property
 Remove Sketch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RemoveTrussSketch { get; }
Public Shared ReadOnly Property RemoveTrussSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RemoveTrussSketch {
	FailureDefinitionId^ get ();
}
static member RemoveTrussSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace